Public Member Functions | List of all members
ACAPI::API_IKeynoteItemEventHandler Class Reference
Notifications Manager
The base class you need to inherit from in case you want to handle keynote item events. More...
#include <KeynoteEventHandler.hpp>
 Inheritance diagram for ACAPI::API_IKeynoteItemEventHandler:
 Public Member Functions
virtual GS::UniString  | GetName () const override final
virtual void  | Dispatch (const API_IEventNotifier &eventNotifier) const override final
It dispatches the event.
virtual GS::UniString  | GetName () const =0
virtual void  | Dispatch (const API_IEventNotifier &eventNotifier) const =0
It dispatches the event.
 Public Member Functions inherited from API_IObjectEventHandler
 virtual void  | OnCreated (const GS::HashSet< API_Guid > &) const
Event handler for object creation events.
 virtual void  | OnModified (const GS::HashSet< API_Guid > &) const
Event handler for object modification events.
 virtual void  | OnDeleted (const GS::HashSet< API_Guid > &) const
Event handler for object deletion events.
Detailed Description
The base class you need to inherit from in case you want to handle keynote item events.
Since
Archicad 28
Member Function Documentation
◆ Dispatch()
 virtual void ACAPI::API_IKeynoteItemEventHandler::Dispatch  |  ( |  const API_IEventNotifier &  |  eventNotifier | ) |   const
finaloverridevirtual
It dispatches the event.
Parameters
eventNotifier | The occurrence of an event can be notified via this parameter.
Implements API_IEventHandler.
◆ GetName()
 virtual GS::UniString ACAPI::API_IKeynoteItemEventHandler::GetName  |  ( |   | ) |   const
finaloverridevirtual
Returns
Human readable name of the event handler.
Implements API_IEventHandler.